InterFoamSimulation/oilWaterParticles/constant/kinematicCloudPositions
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    location    "constant";
    object      kinematicCloudPositions;
}

// 40 manual injection points for basicKinematicCloud (see
// kinematicCloudProperties): 4 clusters of 5 positions straddling each oil
// droplet's edge, plus two 9-point horizontal rows and 2 centre points to
// seed particles across the open water region as well.
40
(
    (0.15 0.30 0.005)
    (0.20 0.30 0.005)
    (0.25 0.30 0.005)
    (0.30 0.30 0.005)
    (0.35 0.30 0.005)

    (0.40 0.55 0.005)
    (0.45 0.55 0.005)
    (0.50 0.55 0.005)
    (0.55 0.55 0.005)
    (0.60 0.55 0.005)

    (0.65 0.35 0.005)
    (0.70 0.35 0.005)
    (0.75 0.35 0.005)
    (0.80 0.35 0.005)
    (0.85 0.35 0.005)

    (0.60 0.75 0.005)
    (0.65 0.75 0.005)
    (0.70 0.75 0.005)
    (0.75 0.75 0.005)
    (0.80 0.75 0.005)

    (0.10 0.20 0.005)
    (0.20 0.20 0.005)
    (0.30 0.20 0.005)
    (0.40 0.20 0.005)
    (0.50 0.20 0.005)
    (0.60 0.20 0.005)
    (0.70 0.20 0.005)
    (0.80 0.20 0.005)
    (0.90 0.20 0.005)

    (0.10 0.80 0.005)
    (0.20 0.80 0.005)
    (0.30 0.80 0.005)
    (0.40 0.80 0.005)
    (0.50 0.80 0.005)
    (0.60 0.80 0.005)
    (0.70 0.80 0.005)
    (0.80 0.80 0.005)
    (0.90 0.80 0.005)

    (0.45 0.45 0.005)
    (0.55 0.45 0.005)
)
