InterFoamSimulation/oilWaterParticles/constant/kinematicCloudProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      kinematicCloudProperties;
}

solution
{
    active          true;
    coupled         false;
    transient       yes;
    cellValueSourceCorrection off;

    interpolationSchemes
    {
        rho         cell;
        U           cellPoint;
        muc         cell;
    }

    integrationSchemes
    {
        U           Euler;
    }

    sourceTerms
    {
        schemes
        {
            U       semiImplicit 1;
        }
    }
}

constantProperties
{
    rho0            2500;    // [kg/m^3] mineral particle density (denser than both water and oil)
    youngsModulus   1e8;     // used only if a collision/wall-rebound model needs contact stiffness
    poissonsRatio   0.35;
}

subModels
{
    // gravity is active here (unlike MainSimulation): constant/g in this
    // case points down, (0 -9.81 0), the normal convention, so applying it
    // directly to the dense particle is physically correct.
    particleForces
    {
        sphereDrag;
        gravity;
    }


    injectionModels
    {
        // 40 parcels released at t=0 (SOI=0) from the positions listed in
        // kinematicCloudPositions, each launched with a small horizontal
        // velocity (0.2 m/s in x) to seed some initial lateral spread.
        model1
        {
            type            manualInjection;
            massTotal       1e-9;
            parcelBasisType fixed;
            nParticle       1;
            SOI             0;
            positionsFile   "kinematicCloudPositions";
            U0              (0.2 0.0 0);
            sizeDistribution
            {
                type        fixedValue;
                fixedValueDistribution
                {
                    value   1e-4;    // 0.1 mm particle diameter
                }
            }
        }
    }


    dispersionModel none;

    patchInteractionModel standardWallInteraction;

    standardWallInteractionCoeffs
    {
        type rebound;
    }

    heatTransferModel none;

    surfaceFilmModel none;

    collisionModel none;

    stochasticCollisionModel none;

    radiation off;
}

cloudFunctions
{
    WeberNumber1
    {
        type    WeberNumber;
        sigma   0.03;    // surface tension [N/m] — adjust to your fluid pair
    }
}
